Output of terraform plan:

```
[command]/home/runner/work/_temp/25646c0b-3613-4d25-9426-48848d4cbbdd/terraform-bin plan -no-color
module.iam.data.aws_iam_role.role_bgr_infra: Reading...
module.ec2.module.iam.data.aws_iam_role.role_bgr_infra: Reading...
module.ec2.module.vpc.aws_vpc.vpc_bgr_infra: Refreshing state... [id=vpc-008a65027c3d7304d]
module.s3.aws_s3_bucket.bgr_infra: Refreshing state... [id=bgr-infra]
module.s3.aws_s3_bucket.dags_airflow: Refreshing state... [id=bgr-dags-airflow]
module.vpc.aws_vpc.vpc_bgr_infra: Refreshing state... [id=vpc-0c3890ff24745cd98]
module.s3.aws_s3_bucket_public_access_block.dags_airflow_public_access_block: Refreshing state... [id=bgr-infra]
module.s3.aws_s3_bucket_policy.dags_airflow_policy: Refreshing state... [id=bgr-dags-airflow]
module.iam.data.aws_iam_role.role_bgr_infra: Read complete after 0s [id=ec2-bgr-infra]
module.ec2.module.iam.data.aws_iam_role.role_bgr_infra: Read complete after 0s [id=ec2-bgr-infra]
module.s3.aws_s3_bucket_policy.bgr_infra_policy: Refreshing state... [id=bgr-infra]
module.s3.aws_s3_bucket_public_access_block.bgr_infra_public_access_block: Refreshing state... [id=bgr-infra]
module.vpc.aws_internet_gateway.gateway_igw_bgr: Refreshing state... [id=igw-0281329c4dc0e11dd]
module.vpc.aws_subnet.sub_bgr_infra[0]: Refreshing state... [id=subnet-01c0c719475b2e4a0]
module.vpc.aws_subnet.sub_bgr_infra[1]: Refreshing state... [id=subnet-0818728e6e0da478a]
module.security_group.aws_security_group.sg_bgr_infra: Refreshing state... [id=sg-0aa63da7e94e90d69]
module.ec2.module.vpc.aws_internet_gateway.gateway_igw_bgr: Refreshing state... [id=igw-01df07a0778be07cd]
module.ec2.module.vpc.aws_subnet.sub_bgr_infra[1]: Refreshing state... [id=subnet-0aaf5f23aeac45b99]
module.ec2.module.vpc.aws_subnet.sub_bgr_infra[0]: Refreshing state... [id=subnet-0b14e0b22dfd93b61]
module.ec2.module.security_group.aws_security_group.sg_bgr_infra: Refreshing state... [id=sg-0b0095028608b1f63]
module.vpc.aws_route_table.rt_bgr_infra: Refreshing state... [id=rtb-0a9fd423ec68da35f]
module.ec2.module.vpc.aws_route_table.rt_bgr_infra: Refreshing state... [id=rtb-07969337c80ecc183]
module.vpc.aws_route_table_association.rta_bgr_infra[0]: Refreshing state... [id=rtbassoc-0499d1b0a3f373b78]
module.vpc.aws_route_table_association.rta_bgr_infra[1]: Refreshing state... [id=rtbassoc-03c00ef918e9f49c6]
module.ec2.module.vpc.aws_route_table_association.rta_bgr_infra[1]: Refreshing state... [id=rtbassoc-0407884c0ed47a1a6]
module.ec2.module.vpc.aws_route_table_association.rta_bgr_infra[0]: Refreshing state... [id=rtbassoc-057cb0b20c6242e7e]
module.ec2.aws_instance.ec2_bgr_infra: Refreshing state... [id=i-05c169afa27fde024]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ec2.aws_instance.ec2_bgr_infra will be updated in-place
  ~ resource "aws_instance" "ec2_bgr_infra" {
        id                                   = "i-05c169afa27fde024"
      ~ instance_type                        = "t2.large" -> "t2.micro"
        tags                                 = {
            "App"  = "bgr-infra"
            "Name" = "bgr_infra"
        }
        # (31 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.s3.aws_s3_bucket.bgr_dags_airflow will be created
  + resource "aws_s3_bucket" "bgr_dags_airflow" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "bgr-dags-airflow"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "production"
          + "Name"        = "bgr-dags_airflow"
        }
      + tags_all                    = {
          + "Environment" = "production"
          + "Name"        = "bgr-dags_airflow"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3.aws_s3_bucket.dags_airflow will be destroyed
  # (because aws_s3_bucket.dags_airflow is not in configuration)
  - resource "aws_s3_bucket" "dags_airflow" {
      - arn                         = "arn:aws:s3:::bgr-dags-airflow" -> null
      - bucket                      = "bgr-dags-airflow" -> null
      - bucket_domain_name          = "bgr-dags-airflow.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "bgr-dags-airflow.s3.us-east-2.amazonaws.com" -> null
      - force_destroy               = true -> null
      - hosted_zone_id              = "Z2O1EMRO9K5GLX" -> null
      - id                          = "bgr-dags-airflow" -> null
      - object_lock_enabled         = false -> null
      - policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:GetObject",
                          - "s3:PutObject",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::444860385156:user/bgr-infra-data"
                        }
                      - Resource  = "arn:aws:s3:::bgr-dags-airflow/*"
                      - Sid       = "AllowUserAccess"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                      = "us-east-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Environment" = "production"
          - "Name"        = "bgr-dags_airflow"
        } -> null
      - tags_all                    = {
          - "Environment" = "production"
          - "Name"        = "bgr-dags_airflow"
        } -> null

      - grant {
          - id          = "ebb67db50403abfa5026b71d1ab9a2c529539543893538d7335c78b340c7ef7b" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.s3.aws_s3_bucket_policy.dags_airflow_policy must be replaced
-/+ resource "aws_s3_bucket_policy" "dags_airflow_policy" {
      ~ bucket = "bgr-dags-airflow" # forces replacement -> (known after apply)
      ~ id     = "bgr-dags-airflow" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:GetObject",
                          - "s3:PutObject",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::444860385156:user/bgr-infra-data"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::bgr-dags-airflow/*",
                        ]
                      - Sid       = "AllowUserAccess"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.s3.aws_s3_bucket_public_access_block.dags_airflow_public_access_block must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "dags_airflow_public_access_block" {
      ~ bucket                  = "bgr-infra" # forces replacement -> (known after apply)
      ~ id                      = "bgr-infra" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: module.iam.data.aws_iam_role.role_bgr_infra: Reading...%0Amodule.ec2.module.iam.data.aws_iam_role.role_bgr_infra: Reading...%0Amodule.ec2.module.vpc.aws_vpc.vpc_bgr_infra: Refreshing state... [id=vpc-008a65027c3d7304d]%0Amodule.s3.aws_s3_bucket.bgr_infra: Refreshing state... [id=bgr-infra]%0Amodule.s3.aws_s3_bucket.dags_airflow: Refreshing state... [id=bgr-dags-airflow]%0Amodule.vpc.aws_vpc.vpc_bgr_infra: Refreshing state... [id=vpc-0c3890ff24745cd98]%0Amodule.s3.aws_s3_bucket_public_access_block.dags_airflow_public_access_block: Refreshing state... [id=bgr-infra]%0Amodule.s3.aws_s3_bucket_policy.dags_airflow_policy: Refreshing state... [id=bgr-dags-airflow]%0Amodule.iam.data.aws_iam_role.role_bgr_infra: Read complete after 0s [id=ec2-bgr-infra]%0Amodule.ec2.module.iam.data.aws_iam_role.role_bgr_infra: Read complete after 0s [id=ec2-bgr-infra]%0Amodule.s3.aws_s3_bucket_policy.bgr_infra_policy: Refreshing state... [id=bgr-infra]%0Amodule.s3.aws_s3_bucket_public_access_block.bgr_infra_public_access_block: Refreshing state... [id=bgr-infra]%0Amodule.vpc.aws_internet_gateway.gateway_igw_bgr: Refreshing state... [id=igw-0281329c4dc0e11dd]%0Amodule.vpc.aws_subnet.sub_bgr_infra[0]: Refreshing state... [id=subnet-01c0c719475b2e4a0]%0Amodule.vpc.aws_subnet.sub_bgr_infra[1]: Refreshing state... [id=subnet-0818728e6e0da478a]%0Amodule.security_group.aws_security_group.sg_bgr_infra: Refreshing state... [id=sg-0aa63da7e94e90d69]%0Amodule.ec2.module.vpc.aws_internet_gateway.gateway_igw_bgr: Refreshing state... [id=igw-01df07a0778be07cd]%0Amodule.ec2.module.vpc.aws_subnet.sub_bgr_infra[1]: Refreshing state... [id=subnet-0aaf5f23aeac45b99]%0Amodule.ec2.module.vpc.aws_subnet.sub_bgr_infra[0]: Refreshing state... [id=subnet-0b14e0b22dfd93b61]%0Amodule.ec2.module.security_group.aws_security_group.sg_bgr_infra: Refreshing state... [id=sg-0b0095028608b1f63]%0Amodule.vpc.aws_route_table.rt_bgr_infra: Refreshing state... [id=rtb-0a9fd423ec68da35f]%0Amodule.ec2.module.vpc.aws_route_table.rt_bgr_infra: Refreshing state... [id=rtb-07969337c80ecc183]%0Amodule.vpc.aws_route_table_association.rta_bgr_infra[0]: Refreshing state... [id=rtbassoc-0499d1b0a3f373b78]%0Amodule.vpc.aws_route_table_association.rta_bgr_infra[1]: Refreshing state... [id=rtbassoc-03c00ef918e9f49c6]%0Amodule.ec2.module.vpc.aws_route_table_association.rta_bgr_infra[1]: Refreshing state... [id=rtbassoc-0407884c0ed47a1a6]%0Amodule.ec2.module.vpc.aws_route_table_association.rta_bgr_infra[0]: Refreshing state... [id=rtbassoc-057cb0b20c6242e7e]%0Amodule.ec2.aws_instance.ec2_bgr_infra: Refreshing state... [id=i-05c169afa27fde024]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.ec2.aws_instance.ec2_bgr_infra will be updated in-place%0A  ~ resource "aws_instance" "ec2_bgr_infra" {%0A        id                                   = "i-05c169afa27fde024"%0A      ~ instance_type                        = "t2.large" -> "t2.micro"%0A        tags                                 = {%0A            "App"  = "bgr-infra"%0A            "Name" = "bgr_infra"%0A        }%0A        # (31 unchanged attributes hidden)%0A%0A        # (8 unchanged blocks hidden)%0A    }%0A%0A  # module.s3.aws_s3_bucket.bgr_dags_airflow will be created%0A  + resource "aws_s3_bucket" "bgr_dags_airflow" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "bgr-dags-airflow"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = true%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Environment" = "production"%0A          + "Name"        = "bgr-dags_airflow"%0A        }%0A      + tags_all                    = {%0A          + "Environment" = "production"%0A          + "Name"        = "bgr-dags_airflow"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # module.s3.aws_s3_bucket.dags_airflow will be destroyed%0A  # (because aws_s3_bucket.dags_airflow is not in configuration)%0A  - resource "aws_s3_bucket" "dags_airflow" {%0A      - arn                         = "arn:aws:s3:::bgr-dags-airflow" -> null%0A      - bucket                      = "bgr-dags-airflow" -> null%0A      - bucket_domain_name          = "bgr-dags-airflow.s3.amazonaws.com" -> null%0A      - bucket_regional_domain_name = "bgr-dags-airflow.s3.us-east-2.amazonaws.com" -> null%0A      - force_destroy               = true -> null%0A      - hosted_zone_id              = "Z2O1EMRO9K5GLX" -> null%0A      - id                          = "bgr-dags-airflow" -> null%0A      - object_lock_enabled         = false -> null%0A      - policy                      = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = [%0A                          - "s3:GetObject",%0A                          - "s3:PutObject",%0A                        ]%0A                      - Effect    = "Allow"%0A                      - Principal = {%0A                          - AWS = "arn:aws:iam::444860385156:user/bgr-infra-data"%0A                        }%0A                      - Resource  = "arn:aws:s3:::bgr-dags-airflow/*"%0A                      - Sid       = "AllowUserAccess"%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> null%0A      - region                      = "us-east-2" -> null%0A      - request_payer               = "BucketOwner" -> null%0A      - tags                        = {%0A          - "Environment" = "production"%0A          - "Name"        = "bgr-dags_airflow"%0A        } -> null%0A      - tags_all                    = {%0A          - "Environment" = "production"%0A          - "Name"        = "bgr-dags_airflow"%0A        } -> null%0A%0A      - grant {%0A          - id          = "ebb67db50403abfa5026b71d1ab9a2c529539543893538d7335c78b340c7ef7b" -> null%0A          - permissions = [%0A              - "FULL_CONTROL",%0A            ] -> null%0A          - type        = "CanonicalUser" -> null%0A        }%0A%0A      - server_side_encryption_configuration {%0A          - rule {%0A              - bucket_key_enabled = false -> null%0A%0A              - apply_server_side_encryption_by_default {%0A                  - sse_algorithm = "AES256" -> null%0A                }%0A            }%0A        }%0A%0A      - versioning {%0A          - enabled    = false -> null%0A          - mfa_delete = false -> null%0A        }%0A    }%0A%0A  # module.s3.aws_s3_bucket_policy.dags_airflow_policy must be replaced%0A-/+ resource "aws_s3_bucket_policy" "dags_airflow_policy" {%0A      ~ bucket = "bgr-dags-airflow" # forces replacement -> (known after apply)%0A      ~ id     = "bgr-dags-airflow" -> (known after apply)%0A      ~ policy = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = [%0A                          - "s3:GetObject",%0A                          - "s3:PutObject",%0A                        ]%0A                      - Effect    = "Allow"%0A                      - Principal = {%0A                          - AWS = "arn:aws:iam::444860385156:user/bgr-infra-data"%0A                        }%0A                      - Resource  = [%0A                          - "arn:aws:s3:::bgr-dags-airflow/*",%0A                        ]%0A                      - Sid       = "AllowUserAccess"%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> (known after apply)%0A    }%0A%0A  # module.s3.aws_s3_bucket_public_access_block.dags_airflow_public_access_block must be replaced%0A-/+ resource "aws_s3_bucket_public_access_block" "dags_airflow_public_access_block" {%0A      ~ bucket                  = "bgr-infra" # forces replacement -> (known after apply)%0A      ~ id                      = "bgr-infra" -> (known after apply)%0A        # (4 unchanged attributes hidden)%0A    }%0A%0APlan: 3 to add, 1 to change, 3 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0

```